python_argparse.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-25 Tue 23:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Argument Parser</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Argument Parser</h1>
<p>
Package <code>argparse</code> is a convenient utility for argument parsing, in which class <code>ArgumentParser</code> is defined. Concerning its usage, a simple example can be given as follows.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">from</span> argparse <span style="color: #b6a0ff;">import</span> ArgumentParser, ArgumentDefaultsHelpFormatter

<span style="color: #00d3d0;">args</span> <span style="color: #ffffff;">=</span> ArgumentParser<span style="color: #ffffff;">(</span>formatter_class<span style="color: #ffffff;">=</span>ArgumentDefaultsHelpFormatter, conflict_handler<span style="color: #ffffff;">=</span><span style="color: #79a8ff;">'resolve'</span><span style="color: #ffffff;">)</span>

<span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">Arguments in the root</span>
args.add_argument<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"--ARGUMENT1"</span>, <span style="color: #f78fe7;">type</span><span style="color: #ffffff;">=</span><span style="color: #f78fe7;">int</span>, metavar<span style="color: #ffffff;">=</span><span style="color: #79a8ff;">''</span>, <span style="color: #f78fe7;">help</span><span style="color: #ffffff;">=</span><span style="color: #79a8ff;">"DESCRIPTION OF ARGUMENT1"</span>, default<span style="color: #ffffff;">=</span>0<span style="color: #ffffff;">)</span>

<span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">Arguments in groups</span>
<span style="color: #00d3d0;">grp1</span> <span style="color: #ffffff;">=</span> args.add_argument_group<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"GROUP1"</span>, <span style="color: #79a8ff;">"DESCRIPTION OF GROUP1"</span><span style="color: #ffffff;">)</span>
grp1.add_argument<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"--ARGUMENT1INGROUP1"</span>, <span style="color: #f78fe7;">type</span><span style="color: #ffffff;">=</span><span style="color: #f78fe7;">float</span>, metavar<span style="color: #ffffff;">=</span><span style="color: #79a8ff;">''</span>, <span style="color: #f78fe7;">help</span><span style="color: #ffffff;">=</span><span style="color: #79a8ff;">"DESCRIPTION OF ARGUMENT1 IN GROUP1"</span>, default<span style="color: #ffffff;">=</span>0<span style="color: #ffffff;">)</span>
grp1.add_argument<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"--ARGUMENT2INGROUP1"</span>, <span style="color: #f78fe7;">type</span><span style="color: #ffffff;">=</span><span style="color: #f78fe7;">int</span>, nargs<span style="color: #ffffff;">=</span>2, metavar<span style="color: #ffffff;">=</span><span style="color: #79a8ff;">''</span>, <span style="color: #f78fe7;">help</span><span style="color: #ffffff;">=</span><span style="color: #79a8ff;">"DESCRIPTION OF ARGUMENT2 IN GROUP1"</span>, default<span style="color: #ffffff;">=</span><span style="color: #ff66ff;">[</span>0, 1<span style="color: #ff66ff;">]</span><span style="color: #ffffff;">)</span>
grp1.add_argument<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"--ENABLEFEATURE1"</span>, <span style="color: #f78fe7;">help</span><span style="color: #ffffff;">=</span><span style="color: #79a8ff;">"DESCRIPTION OF ENABLEFEATURE1 IN GROUP1"</span>, action<span style="color: #ffffff;">=</span><span style="color: #79a8ff;">"store_true"</span><span style="color: #ffffff;">)</span>
...
<span style="color: #00d3d0;">grp2</span> <span style="color: #ffffff;">=</span> args.add_argument_group<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"GROUP2"</span>, <span style="color: #79a8ff;">"DESCRIPTION OF GROUP2"</span><span style="color: #ffffff;">)</span>
...

<span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">Parse the arguments</span>
<span style="color: #00d3d0;">para</span> <span style="color: #ffffff;">=</span> args.parse_args<span style="color: #ffffff;">()</span>

<span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">Use the arguments parsed</span>
<span style="color: #00d3d0;">arg1</span> <span style="color: #ffffff;">=</span> para.ARGUMENT1 <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">arg1 is an integer</span>
<span style="color: #00d3d0;">arg1_grp1</span> <span style="color: #ffffff;">=</span> para.ARGUMENT1INGROUP1 <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">arg1_grp1 is a float</span>
<span style="color: #00d3d0;">arg2_grp1</span> <span style="color: #ffffff;">=</span> para.ARGUMENT2INGROUP1 <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">arg2_grp2 is a list comprising of 2 integers</span>
...
<span style="color: #00d3d0;">feature1_enabler</span> <span style="color: #ffffff;">=</span> para.ENABLEFEATURE1 <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">feature1_enabler is a boolean</span>
</pre>
</div>
</div>
</body>
</html>
